In [2]:
!pip install --upgrade openpyxl

Requirement already satisfied: openpyxl in c:\users\user\anaconda3\lib\site-packages (3.0.10)
Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Requirement already satisfied: et-xmlfile in c:\users\user\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
   - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
   ------------- -------------------------- 81.9/250.0 kB 1.5 MB/s eta 0:00:01
   ---------------------------------------  245.8/250.0 kB 2.2 MB/s eta 0:00:01
   ---------------------------------------- 250.0/250.0 kB 2.2 MB/s eta 0:00:00
Installing collected packages: openpyxl
  Attempting uninstall: openpyxl
    Found existing installation: openpyxl 3.0.10
    Uninstalling openpyxl-3.0.10:
      Successfully uninstalled openpyxl-3.0.10
Successfully installed openpyxl-3.1.2

In [3]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import date

In [4]:
from openpyxl.styles.colors import WHITE, RGB

__old_rgb_set__ = RGB.__set__


def __rgb_set_fixed__(self, instance, value):
    try:
        __old_rgb_set__(self, instance, value)
    except ValueError as e:
        if e.args[0] == 'Colors must be aRGB hex values':
            __old_rgb_set__(self, instance, WHITE)  # Change default color here


RGB.__set__ = __rgb_set_fixed__

In [7]:
df1 = pd.read_excel("oct'23.xlsx", engine = 'openpyxl')
df2 = pd.read_excel("Nov'23.xlsx", engine = 'openpyxl')
df3 = pd.read_excel("sep'23.xlsx", engine = 'openpyxl')

In [12]:
df1

,SL,Outlet,Factory,Customer Name,Customer Code,HR Code,Cash Amount,Credit Amount,Card Amount,MFS Amount,Total Sales Amount,Total Discount,Recovered,Net Credit
0,1,Picard Bangladesh Limited,PICARD,Shahida Begum,AP0190000002,BG000009,267,0.0,0,0,267.0,5.5,0,0.0
1,2,Picard Bangladesh Limited,PICARD,Mukta Banu,AP0190000007,BG000033,0,1347.0,0,0,1347.0,199.0,0,1347.0
2,3,Picard Bangladesh Limited,PICARD,Shefali Begum,AP0190000012,BG000072,1465,0.0,0,0,1465.0,8.0,0,0.0
3,4,Picard Bangladesh Limited,PICARD,Sobuz Miah,AP0190000014,BG000104,0,1490.0,0,0,1490.0,80.0,0,1490.0
4,5,Picard Bangladesh Limited,PICARD,Lone Akther,AP0190000016,BG000108,0,1069.0,0,0,1069.0,41.0,0,1069.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18331,18332,Majumder Garments Limited,Majumder Garments Limited,Mst. Morsheda Begum,AP0200001430,402501,0,2067.0,0,0,2067.0,151.0,0,2067.0
18332,18333,Majumder Garments Limited,Majumder Garments Limited,Md. Kajol Sheikh,AP0200001395,101348,0,1015.0,0,0,1015.0,50.0,0,1015.0
18333,18334,Majumder Garments Limited,Majumder Garments Limited,Md. Asif Molla,AP0200001389,201132,0,1465.0,0,0,1465.0,115.0,0,1465.0
18334,18335,Majumder Garments Limited,Majumder Garments Limited,Mostain Billah,AP0200001411,833912,0,1320.0,0,0,1320.0,83.0,0,1320.0
18335,18336,Majumder Garments Limited,Majumder Garments Limited,Md. Sayedur Rahman,AP0200001782,8007,0,1640.0,0,0,1640.0,360.0,0,1640.0

## Pre - processing

In [14]:
duplicate = df1[df1.duplicated()]
duplicate

Empty DataFrame
Columns: [SL, Outlet, Factory, Customer Name, Customer Code, HR Code, Cash Amount, Credit Amount, Card Amount, MFS Amount, Total Sales Amount, Total Discount, Recovered, Net Credit]
Index: []

In [15]:
duplicate = df2[df2.duplicated()]
duplicate

Empty DataFrame
Columns: [SL, Outlet, Factory, Customer Name, Customer Code, HR Code, Contact Number, Cash Amount, Credit Amount, Card Amount, MFS Amount, Total Sales Amount, Total Discount, Recovered, Net Credit]
Index: []

In [16]:
duplicate = df3[df3.duplicated()]
duplicate

Empty DataFrame
Columns: [SL, Outlet, Factory, Customer Name, Customer Code, HR Code, Cash Amount, Credit Amount, Card Amount, MFS Amount, Total Sales Amount, Total Discount, Recovered, Net Credit]
Index: []

In [19]:
df1.drop_duplicates(subset = ['Customer Code'], inplace = True)

In [20]:
df2.drop_duplicates(subset = ['Customer Code'], inplace = True)

In [21]:
df3.drop_duplicates(subset = ['Customer Code'], inplace = True)

In [22]:
df1.rename(columns = {"Total Sales Amount": "Month_1_Customer_Sales"}, inplace = True)

In [23]:
df2.rename(columns = {"Total Sales Amount": "Month_2_Customer_Sales"}, inplace = True)

In [24]:
df3.rename(columns = {"Total Sales Amount": "Month_3_Customer_Sales"}, inplace = True)

### Merge using join

In [26]:
df = pd.merge(df3,df2, how = 'outer', on ='Customer Code', suffixes = ('_left', '_right'))

In [27]:
df = pd.merge(df, df1, how='outer', on = 'Customer Code', suffixes = ('_left', '_right'))

In [28]:
duplicate = df[df.duplicated()]
duplicate

Empty DataFrame
Columns: [SL_left, Outlet_left, Factory_left, Customer Name_left, Customer Code, HR Code_left, Cash Amount_left, Credit Amount_left, Card Amount_left, MFS Amount_left, Month_3_Customer_Sales, Total Discount_left, Recovered_left, Net Credit_left, SL_right, Outlet_right, Factory_right, Customer Name_right, HR Code_right, Contact Number, Cash Amount_right, Credit Amount_right, Card Amount_right, MFS Amount_right, Month_2_Customer_Sales, Total Discount_right, Recovered_right, Net Credit_right, SL, Outlet, Factory, Customer Name, HR Code, Cash Amount, Credit Amount, Card Amount, MFS Amount, Month_1_Customer_Sales, Total Discount, Recovered, Net Credit]
Index: []

[0 rows x 41 columns]

In [29]:
df.columns

Index(['SL_left', 'Outlet_left', 'Factory_left', 'Customer Name_left',
       'Customer Code', 'HR Code_left', 'Cash Amount_left',
       'Credit Amount_left', 'Card Amount_left', 'MFS Amount_left',
       'Month_3_Customer_Sales', 'Total Discount_left', 'Recovered_left',
       'Net Credit_left', 'SL_right', 'Outlet_right', 'Factory_right',
       'Customer Name_right', 'HR Code_right', 'Contact Number',
       'Cash Amount_right', 'Credit Amount_right', 'Card Amount_right',
       'MFS Amount_right', 'Month_2_Customer_Sales', 'Total Discount_right',
       'Recovered_right', 'Net Credit_right', 'SL', 'Outlet', 'Factory',
       'Customer Name', 'HR Code', 'Cash Amount', 'Credit Amount',
       'Card Amount', 'MFS Amount', 'Month_1_Customer_Sales', 'Total Discount',
       'Recovered', 'Net Credit'],
      dtype='object')

In [30]:
df.drop(['Cash Amount',
       'Credit Amount', 'Card Amount', 'MFS Amount','SL_left', 'Factory_left', 'Cash Amount_left',
       'Credit Amount_left', 'Card Amount_left', 'MFS Amount_left',
        'Total Discount_left', 'Recovered_left',
       'Net Credit_left', 'SL_right',  'Factory_right', 'Cash Amount_right',
       'Credit Amount_right', 'Card Amount_right', 'MFS Amount_right','Total Discount_right', 'Recovered_right',
       'Net Credit_right'] ,axis =1, inplace = True)

In [31]:
df.columns

Index(['Outlet_left', 'Customer Name_left', 'Customer Code', 'HR Code_left',
       'Month_3_Customer_Sales', 'Outlet_right', 'Customer Name_right',
       'HR Code_right', 'Contact Number', 'Month_2_Customer_Sales', 'SL',
       'Outlet', 'Factory', 'Customer Name', 'HR Code',
       'Month_1_Customer_Sales', 'Total Discount', 'Recovered', 'Net Credit'],
      dtype='object')

In [32]:
df['Month_1_Customer_Sales'] = df['Month_1_Customer_Sales'].fillna(0)

In [33]:
df['Month_2_Customer_Sales'] = df['Month_2_Customer_Sales'].fillna(0)

In [34]:
df['Month_3_Customer_Sales'] = df['Month_3_Customer_Sales'].fillna(0)

In [35]:
df.isnull().sum() * 100/len(df)

Outlet_left               39.517813
Customer Name_left        39.517813
Customer Code              0.000000
HR Code_left              39.517813
Month_3_Customer_Sales     0.000000
Outlet_right              56.815216
Customer Name_right       56.815216
HR Code_right             56.815216
Contact Number            56.828266
Month_2_Customer_Sales     0.000000
SL                        40.235547
Outlet                    40.235547
Factory                   40.235547
Customer Name             40.235547
HR Code                   40.235547
Month_1_Customer_Sales     0.000000
Total Discount            40.235547
Recovered                 40.235547
Net Credit                40.235547
dtype: float64

In [36]:
df['HR Code'].fillna(df['HR Code_left'], inplace = True)
df['HR Code'].fillna(df['HR Code_right'], inplace = True)

In [37]:
df['Outlet'].fillna(df['Outlet_right'], inplace = True)
df['Outlet'].fillna(df['Outlet_left'], inplace = True)

In [38]:
df['Customer Name'].fillna(df['Customer Name_right'], inplace = True)
df['Customer Name'].fillna(df['Customer Name_left'], inplace = True)

In [39]:
df.drop(['Recovered', 'Net Credit', 'SL', 'Outlet_left', 'Outlet_right', 'HR Code_right', 'HR Code_left'] ,axis =1, inplace = True)

In [40]:
df.drop(['Total Discount', 'Customer Name_right', 'Customer Name_left'] ,axis =1, inplace = True)

In [41]:
df.drop(['Factory'], axis = 1, inplace = True)

In [43]:
df.head()

,Customer Code,Month_3_Customer_Sales,Contact Number,Month_2_Customer_Sales,Outlet,Customer Name,HR Code,Month_1_Customer_Sales
0,AP0190000001,116.0,NaN,0.0,Picard Bangladesh Limited,Md Wadud,BG000007,0.0
1,AP0190000002,235.0,NaN,0.0,Picard Bangladesh Limited,Shahida Begum,BG000009,267.0
2,AP0190000003,941.0,NaN,0.0,Picard Bangladesh Limited,Hasina 2,BG000010,0.0
3,AP0190000007,1090.0,01959975921,1101.0,Picard Bangladesh Limited,Mukta Banu,BG000033,1347.0
4,AP0190000008,416.0,01774694715,802.0,Picard Bangladesh Limited,Yousuf Ali,BG000034,0.0

In [44]:
df.isnull().sum() * 100/len(df)

Customer Code              0.000000
Month_3_Customer_Sales     0.000000
Contact Number            56.828266
Month_2_Customer_Sales     0.000000
Outlet                     0.000000
Customer Name              0.000000
HR Code                    0.000000
Month_1_Customer_Sales     0.000000
dtype: float64

In [45]:
df.insert(7,"Month 1 Customer", " ")
df['Month 1 Customer'] = np.where(df['Month_1_Customer_Sales'] == 0.0, 0, 1)

In [46]:
df.insert(8,"Month 2 Customer", " ")
df['Month 2 Customer'] = np.where(df['Month_2_Customer_Sales'] == 0.0, 0, 1)

In [47]:
df.insert(9,"Month 3 Customer", " ")
df['Month 3 Customer'] = np.where(df['Month_3_Customer_Sales'] == 0.0, 0, 1)

In [48]:
df.insert(10,"Regularity", " ")

In [49]:
df["Regularity"] = df['Month 1 Customer'] + df['Month 2 Customer'] + df['Month 3 Customer']